; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared3 - mode
	image2 - mode
	thermograph1 - mode
	infrared5 - mode
	spectrograph0 - mode
	infrared4 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet6)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared4)
	(calibration_target instrument5 Star4)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Planet5 infrared4)
	(have_image Planet5 image2)
	(have_image Planet6 infrared3)
	(have_image Planet7 thermograph1)
	(have_image Planet7 infrared5)
	(have_image Planet8 infrared5)
	(have_image Phenomenon9 image2)
))

)

; plan
1. (turn_to satellite1 star0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star0)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon9 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon9 instrument3 image2)
   added: (have_image phenomenon9 image2)
   goals met: 1 of 8
6. (turn_to satellite1 planet5 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet5)
   goals met: 1 of 8
7. (take_image satellite1 planet5 instrument3 image2)
   added: (have_image planet5 image2)
   goals met: 2 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 8
10. (take_image satellite1 planet5 instrument3 infrared4)
   added: (have_image planet5 infrared4)
   goals met: 3 of 8
11. (turn_to satellite0 planet6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet6)
   goals met: 3 of 8
12. (take_image satellite0 planet6 instrument0 infrared3)
   added: (have_image planet6 infrared3)
   goals met: 4 of 8
13. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 4 of 8
14. (take_image satellite0 planet7 instrument0 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 5 of 8
15. (take_image satellite0 planet7 instrument0 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 6 of 8
16. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 6 of 8
17. (take_image satellite0 planet8 instrument0 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 7 of 8
18. (turn_to satellite0 star0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star0)
   goals met: 8 of 8
